app/Services/ApplicationService.php

select `role_id` from `permission_role` where `permission_id` = 167
select `role_id` from `permission_role` where `permission_id` = 168 and `role_id` = 1
delete from `permission_role` where `permission_id` = 168 and `role_id` = 0
select `role_id` from `permission_role` where `permission_id` = 165 and `role_id` = 1
delete from `permission_role` where `permission_id` = 165 and `role_id` = 0
select * from `applications` where (`draft` != 1 and `branch_initiator_id` in (13) or `signers` like '%1%' and `draft` != 1 or `performer_role_id` = 1 and `draft` != 1 or `user_id` = 22 and `draft` != 1) and `applications`.`deleted_at` is null
---
    public function index($request)
    {
        $filial = PermissionRole::where('permission_id', 167)->pluck('role_id')->toArray();
        $company = PermissionRole::where('permission_id', 167)->pluck('role_id')->toArray();
        foreach ($filial as $b) {
            $a = PermissionRole::where('permission_id', 168)->where('role_id', $b)->pluck('role_id')->toArray();
            PermissionRole::where('permission_id', 168)->where('role_id', $a)->delete();
        }
        foreach ($company as $b) {
            $a = PermissionRole::where('permission_id', 165)->where('role_id', $b)->pluck('role_id')->toArray();
            PermissionRole::where('permission_id', 165)->where('role_id', $a)->delete();
        }
        if ($request->ajax()) {

            $user = auth()->user();

            if ($user->hasPermission('ЦУЗ')) {
                $a = 'branch_initiator_id';
                $b = [9, 13];
            } else {
                $a = 'branch_initiator_id';
                $b = [$user->branch_id];

                $c = 'department_initiator_id';
                $d = [$user->department_id];
            }

            if ($user->hasPermission('Add_Company_Signer') && $user->hasPermission('Add_Branch_Signer')) {

                $query = Application::where('draft', '!=', 1)->whereIn($a, $b)->orWhere('signers', 'like', "%{$user->role_id}%")->where('draft', '!=', 1)->orWhere('performer_role_id', $user->role->id)->where('draft', '!=', 1)->orWhere('user_id', auth()->user()->id)->where('draft', '!=', 1)->get();

select * from `branches`
select * from `users` where `role_id` = 1
select `id` from `roles` where json_contains(branch_id, '["13"]')
---
    public function show($application)
    {
        if (PHP_SAPI === 'cli')
            return dd($application);
        $access = SignedDocs::where('role_id', auth()->user()->role_id)->where('status', null)->where('application_id', $application->id)->first();
        $check = SignedDocs::where('role_id', auth()->user()->role_id)->where('application_id', $application->id)->first();
        $branch = Branch::where('id', $application->branch_initiator_id)->first();
        $signedDocs = $application->signedDocs()->get();