app/Services/ApplicationService.php

                $query = $application->get();
                break;
        }
        return Datatables::of($query)
            ->editColumn('is_more_than_limit', function ($query) {
                return $query->is_more_than_limit == ApplicationMagicNumber::one ? __('Компанию') : __('Филиал');
            })
            ->editColumn('created_at', function ($query) {
                return $query->created_at ? with(new Carbon($query->created_at))->format('d.m.Y') : '';
            })
            ->editColumn('branch_initiator_id', function ($query) {
                return $query->branch->name;
            })
            ->editColumn('planned_price', function ($query) {
                return $query->planned_price ? number_format($query->planned_price, ApplicationMagicNumber::zero, '', ' ') : '';
            })
            ->editColumn('updated_at', function ($query) {
                return $query->updated_at ? with(new Carbon($query->updated_at))->format('d.m.Y') : '';
            })
            ->editColumn('date', function ($query) {
                return $query->date ? with(new Carbon($query->date))->format('d.m.Y') : '';
            })
            ->editColumn('delivery_date', function ($query) {
                return $query->updated_at ? with(new Carbon($query->delivery_date))->format('d.m.Y') : '';
            })
            ->addColumn('planned_price_curr', function ($query) {
                $planned_price = $query->planned_price ? number_format($query->planned_price, ApplicationMagicNumber::zero, '', ' ') : '';
                return "{$planned_price}  {$query->currency}";
            })
            ->editColumn('status', function ($query) {
                /*
                 *  Voyager admin paneldan status ranglarini olish va chiqarish
                 */
                $status = $query->status;
                $color = setting("color.{$status}");
                if ($query->performer_status !== null) {
---
select * from `branches` where `branches`.`id` = 13 limit 1

    public function edit_update($application, $request, $user)
    {
        $data = $request->validated();
        $roles = ($application->branch_signers->signers);
        $data['with_nds'] = 0;
        if (isset($data['signers'])) {
            $array = $roles ? array_merge(json_decode($roles), $data['signers']) : $data['signers'];
            $data['signers'] = json_encode($array);
            foreach ($array as $signers) {
                $signer = SignedDocs::where('application_id', $application->id)->where('role_id', $signers)->first();
                $docs = new SignedDocs();
                $docs->role_id = $signers;
                $docs->role_index = Roles::find($signers)->index === null ? ApplicationMagicNumber::one : (Roles::find($signers)->index);
---
select * from `roles` where `roles`.`id` = 1 limit 1