app/Http/Controllers/Site/ApplicationController.php

update `notifications` set `is_read` = `is_read` + 1, `notifications`.`updated_at` = '2022-08-07 06:05:00' where `application_id` = 167 and `user_id` = 22
---
    public function show(Application $application, $view = false)
    {
        if ($view == true) {
            Notification::query()
                ->where('application_id', $application->id)
                ->where('user_id', auth()->id())
                ->increment('is_read');