app/Providers/ViewServiceProvider.php

select * from `notifications` where `user_id` = 22 and `is_read` = 0
---
    public function boot()
    {
        View::composer('site.dashboard.navbar', function ($view) {
            $view->with('notifications', Notification::with('application')
                ->where('user_id', auth()->id())
                ->where('is_read', 0)
                ->get());